{
    "title": "Introduction to the Spring Semester",
    "date": "Spring 2024",
    "sections": [
      {
        "heading": "Rho Pi Alumni Updates",
        "author": "Tomer Avgil – Alumni Chairman",
        "content": "Hello, Alumni! I'm Tomer Avgil, your new Alumni Chair. I'm excited to kick off this semester and oversee the Alumni newsletter. Attached to this newsletter is a letter from the Alumni Fraternity & Sorority Council (AFSC) to the RPI Greek Community. Please take a moment to review it if you're interested."
      },
      {
        "heading": "Alumni Reunion",
        "author": "Tomer Avgil – Alumni Chairman",
        "content": "As we begin the spring semester, I'm thrilled to update you on our chapter's progress and upcoming events. We're actively addressing gaps in our alumni roster from 2014 to 2022, collaborating with nationals to update our records. Please help spread the word so all alumni can reconnect with our community. Additionally, mark your calendars for our In-Person/Zoom reunion on March 17th, 2024, with Bob Feldhuhn hosting the Zoom part and Zev Rosen securing Ballenisles CC in Palm Beach Gardens. RSVP to Phil Gross and Bob by January 28th, indicating your attendance preference. Join our planning Zoom meeting on February 15th or 16th, 2024, at 1 PM Eastern Time. Your involvement ensures a memorable reunion. For more details, contact Phil Gross at philipmgross@optonline.net."
      },
      {
        "heading": "Master’s Minute",
        "author": "Richard Tardio – Master",
        "content": "I am thrilled to begin my first semester as Master. After a great year of rush gaining twenty-three new members, this year looks even more promising. Only one brother will be graduating in the upcoming year leaving us with nothing but potential for growth. One of my many goals for this semester is to achieve three hundred hours of philanthropy continuing to bring awareness not only to the conflict in Israel but many other causes as well. I am honored to be able to lead the chapter at such a pivotal time and hope to provide an environment that will foster growth for the brothers of Rho Pi."
      },
      {
        "heading": "Social Events",
        "author": "Mike DiPietro - Social Chair",
        "content":"To enhance our social standings within the school and Greek life affiliates, our goal is to actively participate in various campus events, showcasing leadership qualities and fostering positive relationships with our peers. Engaging in collaborative efforts with neighboring fraternities is one of our main focuses this semester, as joint events and shared initiatives can contribute to a stronger sense of community and elevate our collective social standing.\nMaintaining a robust connection with sororities and neighboring fraternities is imperative for our social goals. Collaborating on philanthropic projects, and establishing a presence at each other's events is what helps solidify bonds and contribute to the vibrant Greek life community that we strive to bring back.\nWorking closely with our rush chairs is imperative for ensuring a seamless recruitment process this semester. Collaborating on strategies to attract potential new members, emphasizing the unique and appealing aspects of our fraternity. By actively participating in recruitment events and providing valuable insights, we contribute to the overall success of the rush process, strengthening AEΠ’s position within the Greek community."
      },
      {
        "heading": "Rush Update",
        "author" : "Henry Babcock and Jack Dechiro - Rush Chairs",
        "content": "The Spring Rush period is set to begin on January 18 and we shall be opening with a Homestyle Chicken Fry and Game Night with the brotherhood cooking. Recruitment last semester turned out rough for many fraternities due to a lack of sophomore interest. Hence, our two rush chairs, Henry Babcock and Jack DeChiro, prepared all winter break to plan a strategy moving forward to adapt to the new rush climate. We plan to start recruitment in accordance to RPI's rush period by tabling outside of the dining hall and The Union to quickly get our name out there and acquire as many contacts for our first events. With rush being short this semester and with limitations on when we can do events, we will follow up Homestyle Chicken Fry and Game Night with a UFC Fight Night Watch Party, Sports Night, and a Casino Night on the 26th. We then conclude this rush with our Bid Dinner on the 30th with our chef cooking up his iconic chicken parmesan for all of our potential new members."
      },
      {
        "heading": "Brotherhood Events",
        "author" : "Daniel Krupp - Brotherhood Chair",
        "content" : "As the brotherhood chair, I plan on hosting a variety of events to fill our schedule when there isn’t a social event. I will host weekly Milk and Cookies on Mondays and will also schedule larger events, such as a Super Bowl watch party and various movie nights.\nAdditionally, I would like to spearhead outings for the brothers, such as mini golf, bowling, go-karting, or Dave & Busters. These weekend events would serve as fun activities for the brotherhood to do."
      }
    ]
  }
  